; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph1 - mode
	infrared2 - mode
	infrared3 - mode
	spectrograph0 - mode
	Star3 - direction
	GroundStation7 - direction
	Star18 - direction
	Star19 - direction
	GroundStation15 - direction
	Star12 - direction
	GroundStation8 - direction
	Star13 - direction
	Star4 - direction
	Star6 - direction
	GroundStation16 - direction
	GroundStation11 - direction
	Star2 - direction
	GroundStation14 - direction
	Star9 - direction
	Star10 - direction
	Star0 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation17 - direction
	Star20 - direction
	Star21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Star24 - direction
	Phenomenon25 - direction
	Phenomenon26 - direction
	Star27 - direction
	Phenomenon28 - direction
	Star29 - direction
	Planet30 - direction
	Planet31 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation15)
	(supports instrument1 infrared3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation17)
	(supports instrument2 infrared2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation17)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star21)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 GroundStation16)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star9)
	(supports instrument5 infrared3)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation17)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star20)
)
(:goal (and
	(have_image Star20 infrared2)
	(have_image Star21 thermograph1)
	(have_image Star22 infrared2)
	(have_image Phenomenon23 infrared2)
	(have_image Star24 thermograph1)
	(have_image Phenomenon25 infrared3)
	(have_image Phenomenon26 thermograph1)
	(have_image Star27 thermograph1)
	(have_image Phenomenon28 infrared3)
	(have_image Star29 infrared2)
	(have_image Planet30 spectrograph0)
	(have_image Planet31 infrared2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (turn_to satellite1 phenomenon26 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 phenomenon26)
   goals met: 0 of 12
4. (turn_to satellite0 phenomenon23 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 phenomenon23)
   goals met: 0 of 12
5. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 0 of 12
6. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 12
7. (turn_to satellite1 star9 phenomenon26)
   deleted: (pointing satellite1 phenomenon26)
   added: (pointing satellite1 star9)
   goals met: 0 of 12
8. (calibrate satellite1 instrument4 star9)
   added: (calibrated instrument4)
   goals met: 0 of 12
9. (turn_to satellite1 phenomenon25 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon25)
   goals met: 0 of 12
10. (take_image satellite1 phenomenon25 instrument4 infrared3)
   added: (have_image phenomenon25 infrared3)
   goals met: 1 of 12
11. (turn_to satellite1 phenomenon26 phenomenon25)
   deleted: (pointing satellite1 phenomenon25)
   added: (pointing satellite1 phenomenon26)
   goals met: 1 of 12
12. (take_image satellite1 phenomenon26 instrument4 thermograph1)
   added: (have_image phenomenon26 thermograph1)
   goals met: 2 of 12
13. (turn_to satellite1 phenomenon28 phenomenon26)
   deleted: (pointing satellite1 phenomenon26)
   added: (pointing satellite1 phenomenon28)
   goals met: 2 of 12
14. (take_image satellite1 phenomenon28 instrument4 infrared3)
   added: (have_image phenomenon28 infrared3)
   goals met: 3 of 12
15. (turn_to satellite1 planet30 phenomenon28)
   deleted: (pointing satellite1 phenomenon28)
   added: (pointing satellite1 planet30)
   goals met: 3 of 12
16. (take_image satellite1 planet30 instrument4 spectrograph0)
   added: (have_image planet30 spectrograph0)
   goals met: 4 of 12
17. (turn_to satellite1 star21 planet30)
   deleted: (pointing satellite1 planet30)
   added: (pointing satellite1 star21)
   goals met: 4 of 12
18. (take_image satellite1 star21 instrument4 thermograph1)
   added: (have_image star21 thermograph1)
   goals met: 5 of 12
19. (turn_to satellite1 star24 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 star24)
   goals met: 5 of 12
20. (take_image satellite1 star24 instrument4 thermograph1)
   added: (have_image star24 thermograph1)
   goals met: 6 of 12
21. (turn_to satellite1 star27 star24)
   deleted: (pointing satellite1 star24)
   added: (pointing satellite1 star27)
   goals met: 6 of 12
22. (take_image satellite1 star27 instrument4 thermograph1)
   added: (have_image star27 thermograph1)
   goals met: 7 of 12
23. (turn_to satellite0 star6 phenomenon23)
   deleted: (pointing satellite0 phenomenon23)
   added: (pointing satellite0 star6)
   goals met: 7 of 12
24. (calibrate satellite0 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 7 of 12
25. (turn_to satellite0 phenomenon23 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon23)
   goals met: 7 of 12
26. (take_image satellite0 phenomenon23 instrument2 infrared2)
   added: (have_image phenomenon23 infrared2)
   goals met: 8 of 12
27. (turn_to satellite0 planet31 phenomenon23)
   deleted: (pointing satellite0 phenomenon23)
   added: (pointing satellite0 planet31)
   goals met: 8 of 12
28. (take_image satellite0 planet31 instrument2 infrared2)
   added: (have_image planet31 infrared2)
   goals met: 9 of 12
29. (turn_to satellite0 star20 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 star20)
   goals met: 9 of 12
30. (take_image satellite0 star20 instrument2 infrared2)
   added: (have_image star20 infrared2)
   goals met: 10 of 12
31. (turn_to satellite0 star22 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star22)
   goals met: 10 of 12
32. (take_image satellite0 star22 instrument2 infrared2)
   added: (have_image star22 infrared2)
   goals met: 11 of 12
33. (turn_to satellite0 star29 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 star29)
   goals met: 11 of 12
34. (take_image satellite0 star29 instrument2 infrared2)
   added: (have_image star29 infrared2)
   goals met: 12 of 12
